Reports/Противостояние.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Report>
		<Properties>
			<Name>Противостояние</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Чемпионат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Чемпионаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выигрыш</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ничья</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проигрыш</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗабито</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЗабито</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПропущено</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЗабито</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ТурнирнаяТаблица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ТурнирнаяТаблица</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоГолов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОчков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Туры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/Чемпионаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Чемпионаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Лига</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Лига</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Команды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Команды</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыСпорта</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Города</xr:Item>
				<xr:Item>Catalog.Чемпионаты</xr:Item>
				<xr:Item>Catalog.Лига</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/Противостояние/Ext/ObjectModule.bsl
Функция ОтчетСформировать(Объект, ПоказыватьРазницуМячей) Экспорт
	ТабДокумент = Новый ТабличныйДокумент;
	Объект.Данные.Очистить();
	
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	ТурнирнаяТаблица.Команда КАК Команда,
	      	               |	МАКСИМУМ(ВЫБОР
	      	               |			КОГДА Матчи.НомерСтроки = 1
	      	               |				ТОГДА Матчи.Регистратор
	      	               |			ИНАЧЕ NULL
	      	               |		КОНЕЦ) КАК МатчД,
	      	               |	СУММА(ВЫБОР
	      	               |			КОГДА Матчи.НомерСтроки = 1
	      	               |				ТОГДА Матчи.КоличествоГолов
	      	               |			ИНАЧЕ 0
	      	               |		КОНЕЦ) КАК Дома,
	      	               |	МАКСИМУМ(ВЫБОР
	      	               |			КОГДА Матчи.НомерСтроки = 2
	      	               |				ТОГДА ТурнирнаяТаблица.Регистратор
	      	               |			ИНАЧЕ NULL
	      	               |		КОНЕЦ) КАК МатчВ,
	      	               |	СУММА(ВЫБОР
	      	               |			КОГДА Матчи.НомерСтроки = 2
	      	               |				ТОГДА Матчи.КоличествоГолов
	      	               |			ИНАЧЕ 0
	      	               |		КОНЕЦ) КАК Выезд,
	      	               |	СУММА(Матчи.КоличествоГолов) КАК КоличествоЗабито,
	      	               |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоПропущено,
	      	               |	СУММА(Матчи.КоличествоОчков) КАК КоличествоОчков,
	      	               |	СУММА(ВЫБОР
	      	               |			КОГДА Матчи.КоличествоОчков > 1
	      	               |				ТОГДА 1
	      	               |			ИНАЧЕ 0
	      	               |		КОНЕЦ) КАК Выигрыш,
	      	               |	СУММА(ВЫБОР
	      	               |			КОГДА Матчи.КоличествоОчков = 1
	      	               |				ТОГДА 1
	      	               |			ИНАЧЕ 0
	      	               |		КОНЕЦ) КАК Ничья,
	      	               |	СУММА(ВЫБОР
	      	               |			КОГДА Матчи.КоличествоОчков > 0
	      	               |				ТОГДА 0
	      	               |			ИНАЧЕ 1
	      	               |		КОНЕЦ) КАК Проигрыш,
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) КАК КоличествоИгр
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Матчи
	      	               |		ПО ТурнирнаяТаблица.Регистратор = Матчи.Регистратор
	      	               |ГДЕ
	      	               |	ТурнирнаяТаблица.Тур.Владелец В
	      	               |			(ВЫБРАТЬ
	      	               |				ЧемпионатыКоманды.Ссылка КАК Ссылка
	      	               |			ИЗ
	      	               |				Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	      	               |			ГДЕ
	      	               |				ЧемпионатыКоманды.Команда = &Команда
	      	               |				И ЧемпионатыКоманды.Ссылка.ПометкаУдаления = ЛОЖЬ
	      	               |				И ЧемпионатыКоманды.Ссылка.Владелец.Страна В
	      	               |					(ВЫБРАТЬ
	      	               |						Команды.Город.Владелец КАК Ссылка
	      	               |					ИЗ
	      	               |						Справочник.Команды КАК Команды
	      	               |					ГДЕ
	      	               |						Команды.Ссылка = &Команда))
	      	               |	И ТурнирнаяТаблица.Команда В
	      	               |			(ВЫБРАТЬ
	      	               |				ЧемпионатыКоманды.Команда КАК Команда
	      	               |			ИЗ
	      	               |				Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	      	               |			ГДЕ
	      	               |				ЧемпионатыКоманды.Ссылка В
	      	               |					(ВЫБРАТЬ ПЕРВЫЕ 5
	      	               |						ЧемпионатыКоманды.Ссылка КАК Ссылка
	      	               |					ИЗ
	      	               |						Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	      	               |					ГДЕ
	      	               |						ЧемпионатыКоманды.Ссылка.Владелец.ОлимпийскаяСистема = ЛОЖЬ
	      	               |						И ЧемпионатыКоманды.Ссылка.ПометкаУдаления = ЛОЖЬ
	      	               |						И ЧемпионатыКоманды.Команда = &Команда
	      	               |					УПОРЯДОЧИТЬ ПО
	      	               |						ЧемпионатыКоманды.Ссылка.ДатаОкончания УБЫВ)
	      	               |				И ЧемпионатыКоманды.Команда <> &Команда)
	      	               |	И Матчи.Команда = &Команда
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	ТурнирнаяТаблица.Команда
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Команда
	      	               |АВТОУПОРЯДОЧИВАНИЕ");
	Если ЗначениеЗаполнено(Чемпионат) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЧемпионатыКоманды.Команда КАК Команда,
		               |	МАКСИМУМ(ВЫБОР
		               |			КОГДА Матчи.НомерСтроки = 1
		               |				ТОГДА Матчи.Регистратор
		               |			ИНАЧЕ NULL
		               |		КОНЕЦ) КАК МатчД,
		               |	СУММА(ВЫБОР
		               |			КОГДА Матчи.НомерСтроки = 1
		               |				ТОГДА Матчи.КоличествоОчков
		               |			ИНАЧЕ -1
		               |		КОНЕЦ) КАК Дома,
		               |	МАКСИМУМ(ВЫБОР
		               |			КОГДА Матчи.НомерСтроки = 2
		               |				ТОГДА Матчи.Регистратор
		               |			ИНАЧЕ NULL
		               |		КОНЕЦ) КАК МатчВ,
		               |	СУММА(ВЫБОР
		               |			КОГДА Матчи.НомерСтроки = 2
		               |				ТОГДА Матчи.КоличествоОчков
		               |			ИНАЧЕ -1
		               |		КОНЕЦ) КАК Выезд,
		               |	СУММА(ЕСТЬNULL(Матчи.КоличествоГолов, 0)) КАК КоличествоЗабито,
		               |	СУММА(ЕСТЬNULL(ТурнирнаяТаблица.КоличествоГолов, 0)) КАК КоличествоПропущено,
		               |	СУММА(ЕСТЬNULL(Матчи.КоличествоОчков, 0)) КАК КоличествоОчков,
		               |	СУММА(ВЫБОР
		               |			КОГДА Матчи.КоличествоОчков > ТурнирнаяТаблица.КоличествоОчков
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Выигрыш,
		               |	СУММА(ВЫБОР
		               |			КОГДА Матчи.КоличествоОчков = ТурнирнаяТаблица.КоличествоОчков
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Ничья,
		               |	СУММА(ВЫБОР
		               |			КОГДА Матчи.КоличествоОчков > ТурнирнаяТаблица.КоличествоОчков
		               |				ТОГДА 0
		               |			ИНАЧЕ 1
		               |		КОНЕЦ) КАК Проигрыш,
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) КАК КоличествоИгр
		               |ИЗ
		               |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |				МатчКоманды.Регистратор КАК Регистратор,
		               |				МатчКоманды.НомерСтроки КАК НомерСтроки,
		               |				МатчКоманды.КоличествоОчков КАК КоличествоОчков,
		               |				МатчКоманды.КоличествоГолов КАК КоличествоГолов
		               |			ИЗ
		               |				РегистрНакопления.ТурнирнаяТаблица КАК МатчКоманды
		               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |					ПО МатчКоманды.Регистратор = ТурнирнаяТаблица.Регистратор
		               |						И МатчКоманды.НомерСтроки <> ТурнирнаяТаблица.НомерСтроки
		               |			ГДЕ
		               |				МатчКоманды.Команда = &Команда
		               |				И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат) КАК Матчи
		               |			ПО ТурнирнаяТаблица.Регистратор = Матчи.Регистратор
		               |		ПО ЧемпионатыКоманды.Команда = ТурнирнаяТаблица.Команда
		               |ГДЕ
		               |	ЧемпионатыКоманды.Ссылка = &Чемпионат
		               |	И ЧемпионатыКоманды.Команда <> &Команда
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЧемпионатыКоманды.Команда
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	КоличествоОчков УБЫВ,
		               |	КоличествоИгр,
		               |	КоличествоЗабито УБЫВ,
		               |	Дома УБЫВ,
		               |	Команда
		               |АВТОУПОРЯДОЧИВАНИЕ";
	КонецЕсли;
	Запрос.УстановитьПараметр("Чемпионат",				Чемпионат);
	Запрос.УстановитьПараметр("Команда",				Команда);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Лига	= Чемпионат.Владелец;
	ТабДокумент.Вывести(ЗаголовокПолучить(Лига));
	
	Макет  = ПолучитьМакет("Макет");
	ТабДокумент.Вывести(Макет.ПолучитьОбласть("Шапка"));
	ТабДокумент.ФиксацияСверху	= 3;
	
	ОлимпийскаяСистема		= Лига.ОлимпийскаяСистема;
	Итого	= Новый Структура("НомерСтроки,Дома,Выезд,КоличествоЗабито,КоличествоПропущено,КоличествоИгр,КоличествоОчков", 0, 0, 0, 0, 0, 0, 0);
	Пока Выборка.Следующий() Цикл
		Если ОлимпийскаяСистема И Выборка.КоличествоИгр = 0 Тогда Продолжить; КонецЕсли;
		Итого.НомерСтроки	= Итого.НомерСтроки + 1;
		Если ЗначениеЗаполнено(Чемпионат) Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Детали|Начало");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ОбластьМакета.Параметры.Место	= Итого.НомерСтроки;
			ТабДокумент.Вывести(ОбластьМакета);
			Присоединить(ТабДокумент, Макет, Выборка.Дома, Выборка.МатчД);
			Присоединить(ТабДокумент, Макет, Выборка.Выезд, Выборка.МатчВ);
			ОбластьМакета = Макет.ПолучитьОбласть("Детали|Конец");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			Если ПоказыватьРазницуМячей Тогда
				ОбластьМакета.Параметры.КоличествоЗабито	= СтрШаблон("%1-%2", Выборка.КоличествоЗабито, Выборка.КоличествоПропущено);
			КонецЕсли;
			ТабДокумент.Присоединить(ОбластьМакета);
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("Детали1");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ОбластьМакета.Параметры.Место	= Итого.НомерСтроки;
			Если ПоказыватьРазницуМячей Тогда
				ОбластьМакета.Параметры.КоличествоЗабито	= СтрШаблон("%1-%2", Выборка.КоличествоЗабито, Выборка.КоличествоПропущено);
			КонецЕсли;
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		Если Выборка.Дома > 0 Тогда
			Итого.Дома	= Итого.Дома + Выборка.Дома;
		КонецЕсли;
		Если Выборка.Выезд > 0 Тогда
			Итого.Выезд	= Итого.Выезд + Выборка.Выезд;
		КонецЕсли;
		Итого.КоличествоЗабито		= Итого.КоличествоЗабито + Выборка.КоличествоЗабито;
		Итого.КоличествоПропущено	= Итого.КоличествоПропущено + Выборка.КоличествоПропущено;
		Итого.КоличествоИгр	 		= Итого.КоличествоИгр + Выборка.КоличествоИгр;
		Итого.КоличествоОчков		= Итого.КоличествоОчков + Выборка.КоличествоОчков;
		
		Если ЗначениеЗаполнено(Чемпионат) Тогда
			ЗаполнитьЗначенияСвойств(Объект.Данные.Добавить(), Новый Структура("Команда,Выигрыш,Ничья,Проигрыш,КоличествоЗабито,КоличествоПропущено", Выборка.Команда, ?(Выборка.Дома>1, 1, 0) + ?(Выборка.Выезд>1, 1, 0), ?(Выборка.Дома=1, 1, 0) + ?(Выборка.Выезд=1, 1, 0), ?(Выборка.Дома=0, 1, 0) + ?(Выборка.Выезд=0, 1, 0), Выборка.КоличествоЗабито, Выборка.КоличествоПропущено));
		Иначе
			ЗаполнитьЗначенияСвойств(Объект.Данные.Добавить(), Выборка);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Чемпионат) Тогда
		Выборка	= КомментарииПолучить();
		Пока Выборка.Следующий() Цикл
			Итого.КоличествоОчков	= Итого.КоличествоОчков + Выборка.КоличествоОчков;
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ОбластьМакета.Параметры.Заполнить(Итого);
		Если ПоказыватьРазницуМячей Тогда
			ОбластьМакета.Параметры.КоличествоЗабито	= СтрШаблон("%1-%2", Итого.КоличествоЗабито, Итого.КоличествоПропущено);
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьМакета);
		
		Выборка.Сбросить();
		ОбластьМакета = Макет.ПолучитьОбласть("Комментарий");
		Пока Выборка.Следующий() Цикл
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТабДокумент;
КонецФункции

Процедура Присоединить(ТабДокумент, Макет, Данные, Регистратор)
	ОбластьМакета = Макет.ПолучитьОбласть("Детали|" + ?(Данные=0, "LL", ?(Данные=1, "DD", ?(Данные>1, "WW", "NN"))));
	Если ЗначениеЗаполнено(Регистратор) Тогда
		ОбластьМакета.Параметры.Регистратор	= Регистратор;
	КонецЕсли;
	ТабДокумент.Присоединить(ОбластьМакета);
КонецПроцедуры

Функция ЗаголовокПолучить(Лига)
	Если ЗначениеЗаполнено(Чемпионат) Тогда
		Возврат СерверныйФункции.ЗаголовокПолучить(Новый Структура("Лига,Чемпионат,Команда", Лига, Чемпионат, Команда));
	КонецЕсли;
	Возврат СерверныйФункции.ЗаголовокПолучить(Новый Структура("Лига,Чемпионат,ВыводитьЧемпионат", Команда, Команда, Истина));
КонецФункции

Функция КомментарииПолучить()
	Возврат СерверныйФункции.КомментарииПолучить(Чемпионат, Команда);
КонецФункции
